{
  "template": {
    "taskId": "c158e1d3-3db6-4fb2-b5eb-2e8bc832c44a",
    "name": "Networking Online",
    "repo": "Modular-Curriculum",
    "path": "content/career/topics/networking-online/readings/reading-networking-online.md",
    "type": "Reading",
    "timeEstimate": 1800,
    "urls": [
      "networking-online"
    ],
    "topic": "Monday",
    "subtopic": "Lecture",
    "body": "# Networking Online\n\nIf you are only sending out cold applications via job boards, you are only doing\nhalf of the work to land a job! Online Networking is the best way to grow your\nreferral base. Employee referrals, in particular, are the #1 resource for most\ncompanies. Some companies even offer a bonus to their employees if they end up\nhiring one of their referrals. So it’s in your favor to start building out your\nnetwork so you can get a phone screen!\n\nTherefore, it’s important to build yourself up to be SEEN online via online\nprofessional networks like LinkedIn, AngelList, and social media like Facebook\nand Twitter.\n\n## Creating a Snappy, Professional LinkedIn\n\nA good, polished LinkedIn profile is essential during the job search, especially\nin the tech industry. Your LinkedIn will often be the first thing that potential\nemployers, recruiters, and useful contacts look at as they try to evaluate your\nprofessional credentials.\n\nMust haves:\n\n* Professional **photo**\n* **Title or headline**: use keywords:  i.e. Full Stack Software Engineer, Ruby,\n  Rails, React, JavaScript, GraphQL\n* **About me** with keywords and personality\n* **Experience** - with bullets mirroring your resume\n* **Education**\n* **Skills and endorsements**: Make sure your friends are endorsing you and move\n  tech skills to the top\n* **Projects**\n\n## Elements of Your LinkedIn Profile\n\nWhat makes a good LinkedIn profile from top to bottom?\n\n### Photo\n\nMake sure you have a great photo up of you that looks professional. A picture of\nyou on the beach with sunglasses might be nice for Instagram but for LinkedIn a\nnice head shot of you smiling and looking good goes further.\n\nTitle: Right underneath the photo make sure your titles are up-to-date. A lot of\nfolks use their App Academy photo in their LinkedIn profile, but you don't\nnecessarily have to. Remember, you are now a Software Developer.\n\n### Your summary\n\nThe summary is one of the most important parts of your LinkedIn, especially as a\njob-seeker. Unlike the rest of your LinkedIn, it's a chance to inject some\nindividuality and personality into your profile. Ideally, you want it to be\nunique, eye-catching, professional, and personal all at the same time (see why\nit's the hard part?). There's room to be creative and flexible in the summary,\nthough -- it can be long-ish or short, include images, bring in a variety of\npieces from your background -- whatever tells your story the best.\n\nAs you are writing your profile, remember to add in keywords that Recruiters can\nsearch.\n\nNow this is _important_: recruiters use keywords to search for possible\ncandidates based on various criteria. For example, Software Engineer, Software\nDeveloper, Node, Express, Python, Flask, JavaScript, React, etc.\n\nMake sure your summary mentions the languages you know!\n\nClick here for [Tips For Writing A Great LinkedIn Summary][1]\n\nThe following are some good examples for your review:\n\n#### SAMPLE 1\n\n\"I'm a curious puzzle-solver who enjoys pouring over server logs and error\nmessages. I have a passion for software that sews together the desktop and\nmobile experiences. I'm an enthusiastic teammate and a patient communicator. I\nhave a near-compulsive desire to explore the unfamiliar. My favorite languages\nare Ruby, JavaScript, and Korean.”\n\n#### SAMPLE 2\n\n\"Simply put, I love to code. The sleuthwork of identifying the source of a bug\n(especially when the error message is less than helpful). The zen-like state of\nrefactoring tests in a massive codebase. The excitement of implementing a\nlong-anticipated feature. The consistent vacillation between questioning and\nunderstanding. I have a reputation for asking great questions, shipping quality\ncode, being a strong pair and working well across teams. I also have great\nexperience working in Ruby, Rails, jsNode, React and Javascript. For fun I love\nfinding new food carts in town and hanging with my friends at Dolores Park.\"\n\n#### SAMPLE 3\n\n\"I’m a passionate software developer with the innovative and creative mindset of\nan entrepreneur. I have experience building dynamic web applications in\nJavaScript, Ruby on Rails, and HTML/CSS. I love the battle of developing an idea\ninto existence, and forging the bridge between conceptualization and a tangible,\nimpactful product. Programming has been my outlet for problem-solving and\ncreative expression.\"\n\n#### SAMPLE 4\n\n\"People ask me what I do. Here's the list:\n* Software Developer who knows JavaScript, Node, Express, CSS, Python, PostgreSQL, and Flask\n* Mask Maker (Arté Masks)\n* Thespian (Golden Thread Productions)\n* Mentor (Dev Bootcamp)\n* Capoeirista-in-training (Capoeira Angola Quintal)\n* Acrobat-in-training (Circus Center)\n* That wraps up the career and hobbies. I had a 10-year theatre career before I\n  went to a coding bootcamp and revamped my lifestyle. I'm the kind of guy who\n  focuses on many pursuits at once, but really dives deep into all of them.\n  Triple Aries, Triple Sagittarius, and Mars in Gemini, for people who like\n  astrology.\"\n\n#### SAMPLE 5\n\n\"I’m a passionate software developer with the innovative and creative mindset of\nan entrepreneur. I have experience building dynamic web applications in\nJavaScript, Ruby on Rails, and HTML/CSS. I love the battle of developing an idea\ninto existence, and forging the bridge between conceptualization and a tangible,\nimpactful product. Programming has been my outlet for problem-solving and\ncreative expression.\" Another note: you can include images in your summary. Some\nfolks include screenshots of their projects, which is a good way to showcase\nyour work right off the bat.\n\n### Projects\n\nAs an App Academy grad, the projects section of your LinkedIn is very important.\nYou can use the same bullet points that you use in your resume, but you have a\nlittle more flexibility on LinkedIn -- instead of limiting yourself to 3-4\nprojects, list everything substantial, polished, and complete that you've worked\non. You can (and should) include screenshots as well to show off your work, and\nyou can be slightly more verbose when you're describing your project than you\nare in your resume.\n\n### Experience\n\nAs with your projects, you can be a bit more expansive with your previous\nexperience than in your resume. Include any positions that fall into any of the\nfollowing categories:\n\n* Positions that involved quantitative/technical work or research\n* Positions in which you were a supervisor or had a lot of responsibility\n* Positions that you held for >1 year\n* Positions that showcase any unique talents, skills, or knowledge that you have\n\nAs with your resume, include a brief summary of the position and 3-5 bullet\npoints describing your responsibilities. When possible, get endorsements on\nLinkedIn from coworkers and supervisors from the positions you include.\n\nAlso, as with your resume, remember that your bullets showcase what you have\naccomplished as well as specific numbers when possible...just like your resume.\n\nPlease note that unless you are a paid staff person with App Academy, typically\na/A is placed under Education\n\n### Education\n\nInclude anything post-high school, even if it's not a degree from a STEM field.\nList them in chronological order, with App Academy at the top. It's not\nnecessary to include informal/online education unless it was part of a\ncertificate/degree program or was relatively formal in nature (e.g., if you did\na part-time course through General Assembly before a/A, include it, but don't\ninclude Coursera courses).\n\n### Skills\n\nThis is the place to showcase all of the technical skills that you've learned at\nApp Academy and beyond. List your strongest skills first (Python,\nJavaScript, and React should be right at the top) followed by other programming\nskills, followed by any non-programming skills that you have. Make sure that\nyour settings on LinkedIn allow your connections to endorse your skills, and\nalso take some time to endorse the skills of other students in your cohort\n(they'll likely reciprocate if you do so!).\n\n### Volunteer Experience\n\nMost employers won't pay much attention to the volunteer section of your\nLinkedIn, but it can have significant benefit if a recruiter, CEO, or hiring\nmanager shares your passion for a particular cause. It's an immediate personal\nconnection that you wouldn't otherwise get.\n\nOne potential pitfall of the volunteer experience section is that certain causes\nare controversial. If you did organizing work around a hot button political\nissue, you may turn off an employer who falls on the other side of the issue.\nUse your best judgment -- if you're comfortable being \"out\" about supporting a\nparticular cause/organization/community, then by all means include the\nexperience on your LinkedIn.\n\n### Publications\n\nIf you have any academic publications such as research papers, a thesis or\ndissertation, etc.,definitely include these. Anything STEM-related should go at\nthe top of your publication list. Other publications such as poetry, creative\nnonfiction, fiction, etc. is fine to include as well, but make sure it's writing\nthat you'd be fine with a potential employer reading.\n\nLet Recruiters know you’re Searching! But ONLY once your profile is finished!\n\nGo to **Account > Settings and Privacy > Job Seek Preferences**\n\n![2]\n\n## Building Your LinkedIn Network\n\nIt's to your advantage to have a broad network of connections on LinkedIn. Once\nyou've polished your profile, start connecting! Your connections should include:\n\n* Your App Academy cohort, TAs, instructors, and career coaches\n* Former colleagues and supervisors (with some rare exceptions -- if you've been fired or left a job on bad terms, it's not worth connecting)\n* Former professors, teachers, advisors, and other school contacts\n* Friends, especially those who work in tech, live in a city you're interested in working in, and/or who have an extensive professional network\n* Family members\n* Networking contacts that you've met at meetups, a/A events, or elsewhere\n\nWhen in doubt, connect. Don't refuse connections, either, except in rare cases\n(spam, people with job titles you personally wouldn't want to show up in your\nconnections, etc.). Don't stop connecting when you land a job. Your network will\nbe especially important when you're searching for your next job, so keep\nbroadening and building. No rest for the wicked!\n\n### Ideas on how to connect and network on LinkedIn\n\nJust \"connecting\" with someone probably will not get you the best results. Make\nsure to include an awesome note. Examples include:\n\n> \"Hi John. Awesome to meet you last night at the networking event. Would\n> definitely enjoy meeting up again either in person or on Skype to learn more\n> about you, your role and about the company. Might you have time to chat next\n> Monday or Tuesday?\"\n\n> \"Hi Kelly. I noticed you work at ____ . I really like (Company name) because\n> of (specific reasons). Currently I am looking for work as a Software Developer\n> and would sincerely enjoy the chance to learn more about you, your role, the\n> company as well as to increase my network of awesome connections. Might you\n> have time for a brief phone or Skype call on Monday or Tuesday? In advance,\n> thanks for your time and consideration. Looking forward to connecting.\"\n\n### Leveraging Your Network\n\nIf you already have a network on LinkedIn (even if it's not huge), leveraging it\nin your job search can be very effective. Here's how you can go about it.\n\n1. Identify a company you're interested in. Let's go with Pandora, for instance.\n   Do a search for the company, and go to the People who work at ____ result.\n2. If you have a first-degree connection who works in a tech-related position\n   (software developer, product manager, designer, etc.) and who you know well\n   enough to reach out to directly, great! Send them a polite message asking to\n   buy them coffee or lunch and chat about the company. Mention that you're on\n   the job market. They'll likely know that you're looking for a referral to the\n   company; if they don't offer it, politely work it into your conversation. You\n   may also have a first-degree connection who does not work in a tech-related\n   position. For these folks, reach out and ask if they'd be willing to\n   introduce you to one of the software developers. Let them know you're doing\n   research on companies and that you're on the job market.\n3. If you don't have a first-degree connection, take a look at your\n   second-degree connections. Specifically, look at how you're connected to them\n   by going to their profile, and then clicking Mutual Connections.\n\nGo through each of these connections and evaluate two things:\n\n* How well do you know the connection in question?\n* Could you count on this person to go to bat for you, give you a solid recommendation, and facilitate an introduction to their connection at Pandora?\n  * If so, rate them a 1.\n  * If you think they might be willing to give you an introduction but you're not sure, rate them a 2.\n  * If the connection is fairly distant or someone who definitely wouldn't be able to recommend you, rate them a 3.\n* How closely does your connection's Pandora connection match the position you'd\n  like to apply for?\n  * A software engineer, engineering manager, or other member of the technical\n    staff gets a 1.\n  * Someone who'd probably work closely with the engineering staff, such as a\n    product manager or a designer, gets a 2.\n  * Someone totally outside of engineering, such as an administrative assistant,\n    gets a 3.\n\n\nNow, take some action! Evaluate the numbers you got above, and choose the best\npair. Obviously, the best is a 1 and a 1 or a 1/2 -- someone who works at the\ncompany you're interested in who can recommend you to someone who works as a\nsoftware developer. If you don't have a 1/1 pair, choose a 1/2 or a 2/1 pair.\nMessage your connection and ask for an intro:\n\n> \"Hi Nina,\n>\n> Long time no see! I'm writing to ask a favor. I saw that you know Tuhin\n> Chakraborty, who works as a software engineer at Pandora. I'm currently on the\n> job market and I'm really interested in working at Pandora. Would you be\n> willing to set up an introduction for us? Thanks! Scott\"\n>\n> Pairs with worse ratings than 1/2 or 2/1 aren't usually worth trying to\n> leverage, but use your judgment.\n\n\nNow, iterate. If you don't have the network just yet to use it in this way,\ndon't worry -- you will eventually, and you can come back to this strategy when\nyou're ready.\n\n\n### Optional Video\n\nIf you're new to LinkedIn, it may be worth spending an hour learning about the\nplatform. You may consider yourself \"new\" if you have\n\n* less than 50 connections\n* sent 2 or fewer messages through the platform\n* never joined a LinkedIn group\n* not listed or endorsed any LinkedIn Skills before\n\n[This 60-min video][3] presents LinkedIn to engineering students at Columbia\nUniversity. [Another great YouTube video][4] to help get you started.\n\n### Headshot\n\nYou can use your a/A headshot, just download it directly from Progress Tracker!\n\n## Messaging your LinkedIn Network\n\nGood examples of how to message your 1st Degree Connections (your existing network):\n\n> **Email to Software Developer**\n>\n>Hi (name), I’m reaching out to my LinkedIn network and see we’re connected\n>(insert your profile link) . I’ve recently entered the software development\n>space as a (fullstack/frontend/backend) engineer and I’m currently exploring\n>companies. It would be extremely valuable to me to learn more about your\n>professional journey as an engineer and any insight you have of the industry.\n>Would you be open to a 15-20 minute call /videochat in the next couple of\n>weeks? I promise not to take up much of your time, as I’m sure you’re busy!\n>Thank you so much, and look forward to hearing from you.\n\n> **Email to Recruiter/HR**\n>\n>Hi (name), I’m reaching out to my LinkedIn network, and I see we’re connected\n>(insert your profile link) . I’ve recently entered the software development\n>space as a (fullstack/frontend/backend) engineer and I’m currently researching\n>companies. It would be extremely valuable to me to learn more about XXXCOMPANY\n>and the roles you’re hiring for this year. Would you be open to a 15-20 minute\n>call /videochat in the next couple of weeks? I promise not to take up much of\n>your time, as I’m sure you’re busy! Thank you so much, and look forward to\n>hearing from you.\n\n> **Email to non-developer from LI**\n>\n> Hi (name), I’m reaching out to my LinkedIn network and see we’re connected\n> (insert your profile link) I’m exploring companies and I see you work at\n> (company). I’d love the chance to learn more about the culture there, how you\n> like it and your professional journey. Would you be open to a 15-20 minute\n> call or Google Hangout? I promise not to take up too much of your time.\n>\n> I appreciate it! If there is no email in their Contact info, send a LinkedIn\n> message.\n\n## Building your Network\n\n### App Academy Alumni\n\nSearch App Academy School on LinkedIn > Alumni\n\nSearch by name, company or geography > Invite them to connect and leave a note:\n\n> Hi (name), I see you’re an App Academy Grad. I recently graduated from a/A and\n> am looking to expand my network. I see you’re currently at XXXXXCompany. I’d\n> certainly like to learn more about your professional journey and what types of\n> projects you’re working on. Would you be open to a 15-20 minute call\n> /videochat in the next couple of weeks? I promise not to take up too much\n> time. Thank you and I look forward to hearing from you soon.\n\n\nJoin Groups on LinkedIn (college alumni group, tech groups, etc.) invite members\nto connect. Then reach out via note\n\n### Remember: Track and Follow Up\n\n* Your doing all of this work building out your network and reaching out to\n  people. Remember, if you don’t follow up, you’ve dropped the ball!\n* Follow up via email on the ORIGINAL email thread. That way, they can remember\n  the interaction\n* Set up job alerts, and follow up with your contacts when a job becomes\n  available that meets your qualifications\n* You you haven’t yet connected with them on LinkedIn, invite them to connect.\n  Follow them and the company on LinkedIn.\n* Show activity on LinkedIn! Recruiters like to see if you are following their\n  company and you show up in searches more frequently if you have high activity.\n  Comment/Like/Share their posts.\n* Track all of your conversations with your network on a spreadsheet:\n  * Contact name\n  * Company\n  * Title\n  * Email\n  * Date of first meeting and most recent meeting\n  * Where’d you meet? Via LinkedIN? Event?\n  * Conversation: important info\n  * Next step > meet for coffee?\n\n## Creating and Using Your AngelList Profile\n\n[AngelList][5] is a social networking site for startups and job seekers. As with\nLinkedIn, you'll be able to browse companies and they'll be able to take a look\nat your qualifications. The key differences between LinkedIn and AngelList are\n1) AngelList is exclusively tech companies, and 2) you can easily apply to jobs\ndirectly through AngelList. More on the second point later.\n\n### Elements of Your AngelList\n\nThe Work Experience, Education, and Projects sections of AngelList can be\ndirectly copied over from your LinkedIn profile. Be sure to include screenshots\nof your projects in your AngelList profile -- GIF screenshots are especially\ncool. You can use the same profile picture you do in your LinkedIn.\n\n### Mini-Resume\n\nThis is a short description of who you are. Mention that you're a software\ndeveloper. Additionally, you can include the tools you're best at learning, what\nkind of company you're on the market for, and/or some personal details.\nExamples:\n\n> \"Software engineer, experienced in JavaScript and Ruby on Rails. Worked\n> previously in film, non-profit, education, and agriculture. @Yale University\n> '15\"\n\n> \"I am a web developer with a background in Ruby on Rails and\n> JavaScript/React.js. Beyond code, I am a traveler, an archaeologist, and a\n> lifelong learner. \"\n\n### What I Do\n\nThe \"What I Do\" section is almost an extension of your mini-resume. It's your\nchance to elaborate (briefly) on your qualifications and interests. You can\ninclude what you like about coding in general, the kinds of projects you like to\nwork on, the tools you prefer to use, and/or other technical interests you have.\nExamples:\n\n> \"I love web development because I get to make beautiful and functional things.\n> Every day I get to work across scales, from big-picture innovation to\n> nuts-and-bolts problem solving.  Over the last 16 weeks I have been sharpening\n> my skills  on Ruby on Rails, JavaScript and React.js.\"\n\n> \"I'm a current software engineer, former journalist, and sporadic blogger.\n> When I'm not working, I'm probably running, solving Sudokus, putting forth an\n> honest effort at swing dancing, or embarrassing my mother with my karaoke\n> habit. I like puzzles, and that drew me to this field.\"\n\n### Achievements\n\nAngelList asks you to describe \"your greatest achievement\". Of course, they mean\nyour greatest code-related achievement(s). Some people use this space to give an\noverview of every project they've done. Others describe their largest/best\nproject in depth. Either is fine. Write in complete sentences and focus on the\nprojects that showcase your most marketable skills (Ruby on Rails, JavaScript,\nand/or React, as well as anything else you've picked up since a/A that you're\nproud of).\n\n> \"My most recent application is DashboardAlpha (dbalpha.info) where I served as\n> the product owner and full-stack engineer. It was a SeekingAlpha-inspired\n> investment research dashboard that aggregated information and helped investors\n> manage their thoughts on individual securities. I designed an algorithm to\n> dynamically alter displayed content with varying window sizes. I also\n> customized a Backbone.js library to query data from Yahoo! and used Ruby on\n> Rails gems to access Google-search APIs to present updated information of all\n> US stocks.\n>\n> Another application that I built was Breakout.js., a game that challenges\n> players to clear a brick field with a ball. I served as the front-end engineer\n> and used HTML5 canvas to present a dynamic game display and utilized multiple\n> event listeners to give users multiple control methods. I also leveraged CSS3\n> features to present a tabbed menu to display game information.\"\n\n> \"Highlights of my accomplishments:\n> * Sole developer of joglog.me, a full-stack exercise-tracking web application using React on a Rails backend\n> * Selected as primary sustaining engineer for module in Intel's newest production technology after 6 months on job\n> * Graduated with honors from Carnegie Mellon with a double major in engineering\"\n\n### Skills\n\nOn AngelList, your skill list should only include technical skills -- languages,\nlibraries, frameworks, etc. Don't include non-technical skills such as\nspoken/written languages, soft skills, etc. Additionally, AngelList asks you to\nrate your proficiency with each skill. Choose \"Advanced\" for any skills you\nlearned and practiced regularly at App Academy. Use your best judgment for other\nskills you may have picked up elsewhere. The \"Skills\" section is often used by\nemployers to filter for the candidates that have what they're looking for, so be\ncomplete.\n\n### Services\n\nThis section isn't necessary to fill out when you're looking for full-time work.\nIt's generally for folks who are offering specific kinds of on-demand work.\n\n### What I'm Looking For\n\nOf course you want to say here that you're in search of a full-time software\ndevelopment role, but try to make it a little less generic than that. Are you\nseeking a company that has a positive social impact? Are you looking for\nsomewhere that will allow you to work with data analysis? Whatever it is, say it\nhere. Examples:\n\n> \"I love solving challenging problems, especially the ones that relate to\n> scaling and performance improvement. I'm currently looking for an opportunity\n> to work as a Backend Software Engineer, in the SF Bay Area, that exposes me to\n> such problems and hence allows me to grow as an engineer.\"\n\n> \"I want to be engulfed within a whirlwind of passionate people who are\n> consumed by a desire to build something meaningful / beautiful / cool.\"\n\n### Locations\n\nInclude anywhere you're willing to work. Don't include a location unless you'd\nseriously consider taking a job there. As with the \"Skills\" section, employers\nuse location as a filter, so if you don't include your preferred location(s),\nyou're in danger of not being seen by a lot of potential fits.\n\n### Markets\n\nThis isn't strictly necessary to fill out, especially as a newcomer to the\nfield, but it's nice to have. \"Markets\" includes things like social media,\neducational technology, biotechnology, etc.\n\n### Using AngelList\n\n_\"I'm Interested!\"_ vs. _the Star_\n\nIts title is misleading, but the \"Yes, I'm Interested\" button is actually a job\napplication. When you click this, congratulations! You have applied for a job.\nThe employer is notified and will likely look at your profile. You have the\noption of sending the employer a short note when you express interest, and you\nshould always do this. Rather than pasting in your entire cover letter, pare it\ndown to 2-4 sentences about why you'd like to work at the company. If the\ncompany is also interested in you, you'll receive an email letting you know that\nyou have a match. If the company doesn't message you directly, send them a\nfollow-up reiterating your interest and qualifications.\n\nIf you like a job posting but aren't ready to apply, do not hit \"I'm\nInterested\". Instead, star the company to save it for later.\n\n### Who to Follow\n\nStart by following your classmates, TAs, and other people you know personally.\nMuch like Twitter, you can gain helpful information by following leaders in the\ntech community. If you see a CEO, entrepreneur, or someone else who is a big\nname at a company you're interested in, follow that person -- you'll then get\njob recommendations at that company in your feed.\n\n### References\n\nAngelList allows you to give references to your peers and to request references.\nAngelList's rules for references are a little weird -- you can give a reference\nto anyone who you're following and who is also following you. But you can only\nrequest references from people you have worked with in a professional capacity,\nnot collaborators on projects or fellow students.\n\nIf you previously worked in tech in some capacity and you have good references\nwho are on AngelList, it's worth reaching out. Be sure to mention that you're on\nthe job market as a software developer. Additionally, if you worked closely with\na fellow App Academy student on a large project, you may want to give them a\nreference and request a reference from them (of course, you'll have to use some\nother means to make this request -- such as asking them in person :).\n\n### Telling Your Story On AngelList\n\nA great [quick read][6] from Medium\n\nHere is a [good video][7] for your review\n\nExamples of Great AngelList Profiles from Past Graduates\n\n* [Noah Wiener][8]\n* [Billy Littlefield][9]\n* [Minh Nguyen][10]\n* [Satnam Dhanoa][11]\n* [Andrew MacIver][12]\n\n\n## Other online Networking\n\n* Join Slack groups and other industry related chat groups.\n* Join Industry related Facebook groups, Twitter groups, etc.\n* Use matching apps like SHAPR\n* Note: Be sure your social networks like Facebook, Twitter and Instagram represent who you are also as a professional.\n* Stay active! Post a lot!\n\n[1]: https://www.thebalance.com/good-linkedin-summary-with-examples-4126809\n[2]: https://appacademy-open-assets.s3-us-west-1.amazonaws.com/Modular-Curriculum/content/career/topics/networking-online/assets/linkedin-permissions.png\n[3]: https://www.youtube.com/watch?v=KoR9zy3Jge0\n[4]: https://www.youtube.com/watch?v=Ox_ohqsIMAM\n[5]: https://angel.co/\n[6]: https://medium.com/maiden-lane/telling-your-life-story-on-angellist-e9ec8af8d67b\n[7]: https://www.youtube.com/watch?v=_QwLDSKRgMM\n[8]: https://angel.co/noah-wiener\n[9]: https://angel.co/billylittlefield\n[10]: https://angel.co/minh-ngoc-nguyen\n[11]: https://angel.co/satnam14\n[12]: https://angel.co/andrew-maciver\n"
  },
  "success": true
}