{
  "template": {
    "taskId": "2606a438-d517-4efd-bf5c-e97d78023a6e",
    "name": "Crafting Bullet Points",
    "repo": "Modular-Curriculum",
    "path": "content/career/topics/bullet-points/readings/reading-crafting-bullet-points.md",
    "type": "Reading",
    "timeEstimate": 300,
    "urls": [
      "crafting-bullet-points"
    ],
    "topic": "Homework for Friday",
    "subtopic": "Homework",
    "body": "# Crafting Resume Bullets\n\nThe primary purpose of your resume is to demonstrate to a recruiter that you\npossess specific skills. Recruiters spend only a few seconds glancing over your\nresume so you have to rely on keywords to tell the story.\n\n## Steps to take\n\nFirst, you should identify a skill that you brought to bear during your\neducation or job. Then, for each bullet point that you want to create to\nhighlight that skill, you should\n\n1. Determine a compelling way to express what you want to demonstrate using\n   **powerful verbs**\n2. Carefully choose the appropriate **technical keywords** that apply to the\n   skill to get your resume noticed by keyword searches\n3. Mention the **programming concepts** that you use to demonstrate the skill\n4. Use **plain English**, describe the **benefits** or impact that your solution\n   created\n\n## Ideas about what to highlight\n\nCompile a list of the skills you want to demonstrate, then craft your bullets\naround them. The following\n\n### Software related skills\n\n* Anything you coded, even if it was brief or unfinished or unofficial\n* Quantitative analysis / handling data\n* Improvements to a website\n\n### Recognition\n\n* Published something\n* Gave a talk\n* Won an award\n* Given a new responsibility or job title\n\n### Interpersonal skills\n\n* Were part of a team\n* Handled heavy volume of customer...\n* Mentored someone\n* Made clients happy\n* Made coworkers happy\n* Attracted customers\n* Negotiated something\n\n### Output\n\n* Made something faster or better\n* Reduced number of errors\n* Took initiative to do something\n* Delivered project on time\n\n### Money\n\n* Made or saved money\n* Handled lots of money (or widgets worth a lot of money)\n* Delivered project within budget\n\n## Questions to help you start\n\nWhen answering these questions, the key is to point out features you built that\nwent above and beyond the basic requirements. Some of these questions are about\nfeatures that you'll use in future lessons. Keep them in mind as you continue\nthrough the class so that you can note to yourself the novel things that you\ndid.\n\n* Did you find some clever way to DRY up your code? (DRY stands for \"don't\n  repeat yourself\" which means refactoring your code for maintainability)\n* Did you bootstrap some data to avoid extraneous AJAX requests?\n* Did you make some tough choices in your database schema?\n* Did you use cookies or local storage to store anything other than a session token?\n* Does your Javascript use any math to resize something in the DOM?\n* Did you use a library in a way that its author probably didn't anticipate?\n* Do you have any data that's nested one degree deeper than usual?\n* Do your ORM models run any custom SQL queries?\n* Did you make any trade-offs related to performance, eg. store information\n  that's costly to compute?\n* Are you doing any caching?\n* Do you make AJAX requests to any unexpected routes?\n\n## Example 1 (Non technical)\n\n**Skill to Demonstrate**: Leadership\n\n**What did I do?**: Founded company softball team\n\n**How does it demonstrate the key skill?**: Took initiative. Organized long-term\nproject.\n\n**What was the impact or benefit?**: Improved team morale and collaboration.\n\n**Result**: \"Founded and managed company softball team, resulting in improved\nmorale and communication.\"\n\n## Example 2 (Technical)\n\nWhen writing try not to discuss a feature, but try to let the reader know about\nthe feature and what YOU did to make it happen!\n\n**Skill to Demonstrate**: Scaling an application\n\n**What did I do?**: Stored images in the cloud\n\n**How does it demonstrate the key skill?**: Shows I know how to use AWS S3\n\n**What was the impact or benefit?**: Reduces server load and allows for scale\n\n**Result**: \"Stores image uploads in the cloud using AWS S3, reducing server\nload and allowing app to scale gracefully.\"\n\n## Example 3 (Technical)\n\n**Skill to Demonstrate**: Use of a third-party API\n\n**What did I do?**: Determine user locations and filter searches\n\n**How does it demonstrate the key skill?**: Shows I know how to use the Google\nMaps API\n\n**What was the impact or benefit?**: Allows users to search for each other based\non location\n\n**Result**: \"Integrates Google Maps API with geolocation based searching to\ndisplay location of other users on a map.\"\n\n### Example bullet points:\n\n* Integrated the Open Street Maps API with custom search functionality to\n  dynamically present business locations based on user parameters.\n* Utilized Redux architecture's unidirectional data flow with React for\n  predictable state and reliable DOM rendering\n* Used observer pattern to handle management of global Z-indexes for overlapping\n  items.\n* Lowered latency of DB read/write by factor of 7 by using Unicorn to enable\n  virtual multi-threaded processing.\n* Designed dynamic data-visualizations with Javascript implemented algorithms\n  based on user input\n* Created custom modal framework using React component architecture allowing for\n  efficient development of new forms.\n* Created top-level music player using HTML5 audio and React, giving the user\n  seamless audio streaming during navigation.\n* Leveraged custom event listeners and the Redux cycle to dynamically sync audio\n  waveforms and play-pause toggle buttons with music player.\n* Utilized CSS media queries to create a fully responsive, device agnostic\n  design.\n* Configured the Node backend with PostgreSQL, using the Sequelize ORM for\n  validations and database queries.\n* Incorporated MVC architecture with Polymorphic model associations, reducing\n  the number of required tables by almost 50%.\n* Implemented local strategy for user authentication with Passport.js, using\n  BCrypt for password hashing.\n* Generated intelligent, movement-based animation using asynchronous Javascript.\n* Developed collision detection algorithm for sprite characters, and integrated\n  with keystroke event listeners to predict future player direction and\n  movement.\n* Utilized HTML Image Maps to allow users to click directly on an item in a\n  photograph.\n* Recorded user activity using React Router to create a seamless user experience\n  during authentication process and app navigation.\n* Processed and displayed real-time BTC price data in the Sentiment Analysis by\n  simultaneously leveraging Twitter Streaming API and CoinBase Digital Currency\n  API\n* Developed a custom responsive calendar using CSS3 to display logged infusions.\n"
  },
  "success": true
}